[
  {
    "title": "Bot Personality",
    "content": "• Warm, welcoming, and calm.  \n• Encouraging and supportive, never judgmental.  \n• Explains yoga concepts simply and clearly.  \n• Uses gentle emojis (🌿, 🌙, ✨) sparingly to add warmth.  \n• Ask follow up Questions.\n\n---",
    "tags": [],
    "priority": 5
  },
  {
    "title": "Frequently Asked Questions",
    "content": "**Are the Begin classes right for me?**  \nBegin classes are suitable for any student new to yoga or new to the Iyengar method. They are also great for anyone coming back to yoga after a break. These classes focus on the foundations of the Iyengar method, with an emphasis on precision, alignment, and timing.\n\n**Do I need to book into classes?**  \nYes, it is important to book to ensure availability and to receive notifications of any class cancellations.  \n👉 [View Class Schedule](https://marrickvilleyoga.punchpass.com/classes)\n\n**Can I do a class if I have an injury?**  \nOur regular classes are designed for students who are generally well.  \n• Stiffness is not a problem.  \n• Minor injuries that allow you to move freely are usually fine. Just be sure to advise your teacher at the beginning of class.  \n• For more significant injuries or illness, we recommend a Yoga Therapy – Personal session for one-on-one support.\n\n**What equipment do I need to bring?**  \nJust bring yourself. We provide all the props and equipment you will need in class. You are welcome to bring your own mat if you prefer.\n\n**Do you have change rooms?**  \nWe have a bathroom that can be used as a change room.\n\n**How can I pause my Direct Debit or membership?**  \nYou may suspend your pass for holidays, business travel, illness, or injury.  \n• Notice: 7 days’ notice is required via email.  \n• Suspension Length: Minimum 1 week (in one-week blocks).  \n• Limit: Maximum 3 suspensions per year.\n\n**Do you have pre-natal classes?**  \nWe do not offer specific pre-natal classes. We also do not recommend that people who are pregnant start yoga at our studio. However, long-term students with an established relationship with our senior teachers may continue to practice, as they are trained and experienced to guide students safely during pregnancy.\n\n**Can I get a refund for a course or workshop?**  \nPlease advise us by email as soon as possible. Refunds incur a $30 administration fee.\n\n---",
    "tags": [
      "classes",
      "schedule",
      "studio",
      "pass",
      "membership",
      "injury",
      "equipment",
      "refund",
      "therapy",
      "suspension",
      "iyengar"
    ],
    "priority": 5
  },
  {
    "title": "2 Week Introductory Pass",
    "content": "**What is included?**  \nThe Intro Pass is valid for all regular classes and Yoga Therapy group classes (Knees & Hips, Neck & Back). It does not include Yoga Therapy – Personal Sessions.\n\n**Is it suitable for beginners?**  \nThe Intro Pass is not ideal for complete beginners. It is designed for new students only, and some prior yoga experience (Iyengar or other styles) is required. If you are completely new to yoga, we recommend the Unlimited 5 Week Begin Pass ($70).\n\n**What classes should I attend?**  \n• If you are still learning inversions, Begin classes are the right fit.  \n• If you are confident with inversions, you can attend General and Experienced classes.\n\n---",
    "tags": [
      "classes",
      "beginner",
      "pass",
      "therapy",
      "iyengar"
    ],
    "priority": 10
  },
  {
    "title": "About Iyengar Yoga",
    "content": "Iyengar Yoga was developed by B.K.S. Iyengar over 70 years ago. It is a dynamic, physical, and rejuvenating practice suited to all ages and fitness levels. Through regular practice, you can expect improvements in flexibility, strength, and balance, along with increased energy levels and mental focus.\n\n**What sets Iyengar Yoga apart?**  \n• Precise, detailed instruction: Emphasis on clear teacher instruction and attention to alignment to bring the body into healthy balance.  \n• Use of props: Items like blankets, bricks, bolsters, and belts make yoga accessible and safe for all body types and ages.  \n• Rigorous teacher training: Iyengar Yoga maintains high standards for accreditation and ongoing teacher development. All teachers at the studio are certified by the Iyengar Yoga Association of Australia or are training under a Senior Teacher.\n\n---",
    "tags": [
      "studio",
      "iyengar"
    ],
    "priority": 5
  },
  {
    "title": "Yoga Therapy Education with Stephanie Quirk",
    "content": "**Course Overview**  \n\"Seeing & Understanding from the Base\" is a 7-part Yoga Therapy course led by Stephanie Quirk, a world leader in Yoga Therapeutics. Stephanie spent 20 years at RIMYI in Pune, India, working with the Iyengar family in medical classes.  \nThis series helps teachers, trainees, and experienced practitioners understand how to work with students who have common issues, while deepening their own practice.\n\n**Format & Schedule**\n\n- 7 modules taught sequentially (1 per year).\n- Each part runs over **4 days**:\n  - Days 1–3: 10am–1pm & 3pm–5:30pm\n  - Day 4: 9am–12pm & 2pm–4:30pm\n- Includes live in-studio & online options, with recordings available for 6 months.\n\n**Parts & Topics**\n\n- Part 1: Feet, Knees & Hips (Aug 2023) – recordings available.\n- Part 2: Arms, Shoulders & Neck (Mar 2024) – recordings available.\n- Part 3: Lower Spine & Pelvis (Aug 2024) – recordings available.\n- Parts 4–7 will cover additional regions and systems of the body.\n\n---",
    "tags": [
      "classes",
      "schedule",
      "studio",
      "therapy",
      "iyengar"
    ],
    "priority": 5
  },
  {
    "title": "Teacher Mentorship Program",
    "content": "**Program Details**  \nThe purpose of this Teacher Mentorship Program is a professional development program to provide individual support and guidance to certified Iyengar Yoga teachers, who are looking to gradually deepen and develop their own yoga practice. Expand and explore your teaching skills and understanding of Iyengar yoga.\n\nFurther details including buttons to register are provided below.\n\n**Marrickville Yoga Centre**  \nMarrickville Yoga Centre is made up of a vibrant community of teachers, practitioners and dedicated students. A full diverse timetable of classes for all levels of students. MYC has an extensive Yoga therapy program providing the opportunity for assisting in weekly therapy classes. It also runs an international online Yoga school delivering daily classes, specialty workshops and training programs in Yoga therapy.\n\nMarrickville Yoga Centre has a long history of sharing knowledge, and working with selected respected teachers we know from around the world. MYC has created and developed an inclusive and welcoming environment.\n\nStudents will be encouraged to spend blocks of time at Marrickville Yoga Centre.\n\n**Simon Joannou**  \nSimon Joannou has been practising Iyengar Yoga for over 25 years and has studied with Iyengar Family for over 20 years. He is a certified Iyengar Yoga Level 3 teacher and has been the principal of Marrickville Yoga Centre for over 15 years. Simon has had extensive training and experience in the area of Yoga therapy working closely with Stephanie Quirk for many years.\n\nSimon has run teacher training and mentoring programs for 12 years. He is also an experienced assessor as well as being a moderator for the Australian Iyengar Yoga Association.\n\n---\n\n### FAQ\n\n**Who is this program for?**  \nCertified Iyengar yoga teachers who are ready to further develop their practice, their teaching, and their understanding of the methodology of Iyengar yoga.\n\n**How does it work?**  \nEach program will be unique to the individual teacher's needs. Teachers meet with Simon to discuss their goals in developing practice and teaching. A program of study is then developed together.\n\n**What's involved?**\n\n- Monthly 30-minute consultation.\n- Program runs from March till October.\n- Teaching, practising, and presentation segments are generally held on Saturday afternoons from 2pm–4pm.\n\n**What topics are covered?**\n\n- Running a Yoga Centre\n- Developing Teacher Training Programs\n- Developing your Yoga practice\n- Yoga therapy\n- Teaching process\n- Observation in teaching\n- Yoga philosophy\n- Teaching and practising pranayama\n- Teaching specialist classes\n- Level 2 and 3 syllabus\n- Preparing for next level of assessment\n\n**What are the costs?**\n\n- Full cost: $1,000 if paid in full before commencement.\n- Payment plan: $600 initial payment to register + $400 in June.\n\n**Dates for 2025**\n\n- Mar 22\n- May 10, May 31\n- Jun 28\n- Jul 19\n- Aug 30\n- Sep 27\n- Oct 25\n- Nov 15",
    "tags": [
      "classes",
      "therapy",
      "iyengar"
    ],
    "priority": 5
  }
]