[
  {
    "title": "Yoga Therapy Education with Stephanie Quirk",
    "content": "**Course Overview**\n\"Seeing & Understanding from the Base\" is a 7-part Yoga Therapy course led by Stephanie Quirk, a world leader in Yoga Therapeutics. Stephanie spent 20 years at RIMYI in Pune, India, working with the Iyengar family in medical classes. This series helps teachers, trainees, and experienced practitioners understand how to work with students who have common issues, while deepening their own practice.\n\n**Format & Schedule**\n- 7 modules taught sequentially (1 per year).\n- Each part runs over **4 days**:\n  - Days 1–3: 10am–1pm & 3pm–5:30pm\n  - Day 4: 9am–12pm & 2pm–4:30pm\n- Includes live in-studio & online options, with recordings available for 6 months.\n\n**Parts & Topics**\n- Part 1: Feet, Knees & Hips (Aug 2023) – recordings available.\n- Part 2: Arms, Shoulders & Neck (Mar 2024) – recordings available.\n- Part 3: Lower Spine & Pelvis (Aug 2024) – recordings available.\n- Parts 4–7 will cover additional regions and systems of the body.",
    "tags": [
      "therapy",
      "course",
      "stephanie quirk",
      "education",
      "specialized"
    ],
    "priority": 8
  },
  {
    "title": "Teacher Mentorship Program",
    "content": "**Program Details**\nThe purpose of this Teacher Mentorship Program is a professional development program to provide individual support and guidance to certified Iyengar Yoga teachers, who are looking to gradually deepen and develop their own yoga practice. Expand and explore your teaching skills and understanding of Iyengar yoga.\n\n**Marrickville Yoga Centre**\nMarrickville Yoga Centre is made up of a vibrant community of teachers, practitioners and dedicated students. A full diverse timetable of classes for all levels of students. MYC has an extensive Yoga therapy program providing the opportunity for assisting in weekly therapy classes. It also runs an international online Yoga school delivering daily classes, specialty workshops and training programs in Yoga therapy.\n\nMarrickville Yoga Centre has a long history of sharing knowledge, and working with selected respected teachers we know from around the world. MYC has created and developed an inclusive and welcoming environment.\n\nStudents will be encouraged to spend blocks of time at Marrickville Yoga Centre.\n\n**Simon Joannou**\nSimon Joannou has been practising Iyengar Yoga for over 25 years and has studied with Iyengar Family for over 20 years. He is a certified Iyengar Yoga Level 3 teacher and has been the principal of Marrickville Yoga Centre for over 15 years. Simon has had extensive training and experience in the area of Yoga therapy working closely with Stephanie Quirk for many years.\n\nSimon has run teacher training and mentoring programs for 12 years. He is also an experienced assessor as well as being a moderator for the Australian Iyengar Yoga Association.\n\n### FAQ\n\n**Who is this program for?**\nCertified Iyengar yoga teachers who are ready to further develop their practice, their teaching, and their understanding of the methodology of Iyengar yoga.\n\n**How does it work?**\nEach program will be unique to the individual teacher's needs. Teachers meet with Simon to discuss their goals in developing practice and teaching. A program of study is then developed together.\n\n**What's involved?**\n- Monthly 30-minute consultation.\n- Program runs from March till October.\n- Teaching, practising, and presentation segments are generally held on Saturday afternoons from 2pm–4pm.\n\n**What topics are covered?**\n- Running a Yoga Centre\n- Developing Teacher Training Programs\n- Developing your Yoga practice\n- Yoga therapy\n- Teaching process\n- Observation in teaching\n- Yoga philosophy\n- Teaching and practising pranayama\n- Teaching specialist classes\n- Level 2 and 3 syllabus\n- Preparing for next level of assessment\n\n**What are the costs?**\n- Full cost: $1,000 if paid in full before commencement.\n- Payment plan: $600 initial payment to register + $400 in June.\n\n**Dates for 2025**\n- Mar 22\n- May 10, May 31\n- Jun 28\n- Jul 19\n- Aug 30\n- Sep 27\n- Oct 25\n- Nov 15",
    "tags": [
      "mentorship",
      "teacher training",
      "simon joannou",
      "professional development"
    ],
    "priority": 7
  }
]
